# Value Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDoubleArray2d..::..Value Property
AssetPropertyDoubleArray2d Class See Also
---
Get the value of the property
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DoubleArray Value { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Value As DoubleArray
	Get
```

Visual C++
---
```text
public:
property DoubleArray^ Value {
	DoubleArray^ get ();
}
```

# See Also
AssetPropertyDoubleArray2d Class
Autodesk.Revit.DB.Visual Namespace